//*==============================================
//Draw2D.h
//*==============================================
#pragma once

//===============================================
//include 
//===============================================
#include "gameobject.h"

//===============================================
//class
//===============================================
//[Desc]
//	2D描画用
//===============================================
class CDraw2DInit :public CGameObject
{
	private:
	
	public:
	
		CDraw2DInit(void){};//コンストラクタ
		~CDraw2DInit(void){};//デストラクタ
		
		void Init(){};//初期化
		void Exec();//処理
};

//===============================================
//class
//===============================================
//[Desc]
//	2D描画用
//===============================================
class CDraw2DEnd :public CGameObject
{
	private:
	
	public:
	
		CDraw2DEnd(){};//コンストラクタ
		~CDraw2DEnd(){};//デストラクタ
		
		void Init(){};//初期化
		void Exec();//処理
};
