//*==============================================
//Effect.cpp
//*==============================================

//===============================================
//include
//===============================================
#include "Effect.h"

//===============================================
//コンストラクタ
//===============================================
CEffect::CEffect(void)
{

}

//===============================================
//コンストラクタ
//===============================================
//[input]
//	name:データ名
//===============================================
CEffect::CEffect(char *name)
{
	m_NumBoneMatricesMax	= 0;
	m_pBoneMatrices			= NULL;
	m_pFrameRoot			= NULL;
	m_pAnimController		= NULL;
	D3DXMatrixIdentity( &m_matWorld );
	
	//m_vPos.Set(0, 0, 0);
	m_vPos.Set(0, 0, 0);
	m_vRot.Set(0, 0, 0);
	
	m_IsVariable = false;
	
	m_vScale.Set(1.0f, 1.0f, 1.0f);
	
	m_AnimSpeed = 0.0001f;	
	
	m_CurAnimID = 0;
	
	Load(Joker::GetDevice(), name, NULL );
	
}

//===============================================
//デストラクタ
//===============================================
CEffect::~CEffect(void)
{
	Release();
}

//===============================================
//処理
//===============================================
void CEffect::Exec()
{
	//SetPosition(
	
	if(m_IsVariable)
	{
		Translation(m_vPos.x, m_vPos.y, m_vPos.z);
		
		Scaling(m_vScale.x, m_vScale.y, m_vScale.z);
		
		//Heading(m_vRot.x);
		//
		Pitching(m_vRot.x);
		//
		//Rolling(m_vRot.x);
		
		Render(Joker::GetDevice());
		
		m_pAnimController->AdvanceTime(m_AnimSpeed, NULL);
		
		SetWorldMatrix();
	}
	
}

//===============================================
//位置の設定
//===============================================
//[input]
//	Pos:位置
//===============================================
void CEffect::SetPosition(CVector3 Pos)
{
	m_vPos = Pos;
}

//===============================================
//位置の加算
//===============================================
//[input]
//	Pos:位置
//===============================================
void CEffect::AddPosition(CVector3 Pos)
{
	m_vPos -= Pos;
}


//===============================================
//存在フラグの設定
//===============================================
//[input]
//	flag:存在フラグ
//===============================================
void CEffect::SetVariableFlag(bool flag)
{
	m_IsVariable = flag;
}

//===============================================
//拡縮率の設定
//===============================================
//[input]
//	Scale:拡大率
//===============================================
void CEffect::SetScale(CVector3 Scale)
{
	m_vScale = Scale;
}

//===============================================
//拡縮率の設定
//===============================================
//[input]
//	Scale:拡大率
//===============================================
void CEffect::SetRotate(CVector3 Rot)
{
	m_vRot = Rot;
}

//===============================================
//存在フラグの取得
//===============================================
//[return]
//	存在フラグ
//===============================================
bool CEffect::GetVariableFlag()
{
	return m_IsVariable;
}











