//*==============================================
//field.h
//*==============================================
#pragma once

//===============================================
//include
//===============================================
#include "CXModel.h"

//===============================================
//class
//===============================================
//[Desc]
//	フィールド用クラス
//===============================================
class CField :public CXModel
{
	private:
	
		CVector3 m_vPos;//座標
		CVector3 m_vRot;//角度
		CVector3 m_vScale;//拡縮
		
	public:
	
		CField();//コンストラクタ
		~CField();//デストラクタ
		
		void Init();//初期化
		void Exec();//処理
		
		CVector3 GetPosition();//座標の取得
	
};