//===============================================
//System.h
//===============================================
#pragma once

//===============================================
//include
//===============================================
#include "CXModel.h"

//===============================================
//class
//===============================================
//[Desc]
//	システムグラフィック	
//===============================================
class CSystem :	public CXModel
{
	private:
	
		CVector3 m_vPos;//座標
		CVector3 m_vRot;//角度
		CVector3 m_vScale;//拡縮
		
	public:
		
		CSystem(void);//コンストラクタ
		~CSystem(void);//デストラクタ
		
		void Init();//初期化
		void Exec();//処理
};
